OpenFoam_Cases/Channel_14124_M3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
	//solver		PBiCGStab;
	//preconditioner	diagonal;        
	solver          GAMG;
        tolerance       1e-12;
        relTol          0.001;
        minIter         2;
        maxIter         100;
        smoother        GaussSeidel;
	//nPreSweeps       1;
        //nPostSweeps      3;
        //nFinestSweeps    3;
        //scaleCorrection true;
        //directSolveCoarsest false;
        //cacheAgglomeration on;
        //nCellsInCoarsestLevel 50;    // 500
        ////agglomerator     faceAreaPair;
        //mergeLevels      1;    // 3
    }

    "(U|k|omega)"
    {
        solver          PBiCG;
	preconditioner	DILU;
        tolerance       1e-12;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;
    pRefCell       0;
    pRefValue       1;

    residualControl
    {
        p               1e-15;
        U               1e-12;
        "(k|epsilon|omega|f|v2)" 1e-12;
    }
}

relaxationFactors
{
    equations
    {
        U               0.5; // 0.9 is more stable but 0.95 more convergent
	p		0.5;         
	".*"            0.7; // 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
